## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_consumption_budget_subscription.global_budget will be created
  + resource "azurerm_consumption_budget_subscription" "global_budget" {
      + amount          = 10
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "global_subscription_budget"
      + subscription_id = "/subscriptions/c6f0ed16-c14a-496d-9781-a8734d31261c"
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = [
              + "hello@domingasp.com",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "EqualTo"
          + threshold      = 60
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2024-09-01T00:00:00Z"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>